MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F373RB/mcu.h
#define ADC1_V2_5                                      /*!< ADC IP version */

/*
 * @brief Specific device feature definitions (not present on all devices in the STM32F3 series)
 */
/* Note: No specific macro feature on this device */

/********************  Bit definition for ADC_SR register  ********************/
#define ADC_SR_AWD_Pos                 (0U)                                    
#define ADC_SR_AWD_Msk                 (0x1UL << ADC_SR_AWD_Pos)                /*!< 0x00000001 */
#define ADC_SR_AWD                     ADC_SR_AWD_Msk                          /*!< Analog watchdog flag */
#define ADC_SR_EOC_Pos                 (1U)                                    
#define ADC_SR_EOC_Msk                 (0x1UL << ADC_SR_EOC_Pos)                /*!< 0x00000002 */
#define ADC_SR_EOC                     ADC_SR_EOC_Msk                          /*!< End of conversion */
#define ADC_SR_JEOC_Pos                (2U)                                    
#define ADC_SR_JEOC_Msk                (0x1UL << ADC_SR_JEOC_Pos)               /*!< 0x00000004 */
#define ADC_SR_JEOC                    ADC_SR_JEOC_Msk                         /*!< Injected channel end of conversion */
#define ADC_SR_JSTRT_Pos               (3U)                                    
#define ADC_SR_JSTRT_Msk               (0x1UL << ADC_SR_JSTRT_Pos)              /*!< 0x00000008 */
#define ADC_SR_JSTRT                   ADC_SR_JSTRT_Msk                        /*!< Injected channel Start flag */
#define ADC_SR_STRT_Pos                (4U)                                    
#define ADC_SR_STRT_Msk                (0x1UL << ADC_SR_STRT_Pos)               /*!< 0x00000010 */
#define ADC_SR_STRT                    ADC_SR_STRT_Msk                         /*!< Regular channel Start flag */

/*******************  Bit definition for ADC_CR1 register  ********************/
#define ADC_CR1_AWDCH_Pos              (0U)                                    
#define ADC_CR1_AWDCH_Msk              (0x1FUL << ADC_CR1_AWDCH_Pos)            /*!< 0x0000001F */
#define ADC_CR1_AWDCH                  ADC_CR1_AWDCH_Msk                       /*!< AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define ADC_CR1_AWDCH_0                (0x01UL << ADC_CR1_AWDCH_Pos)            /*!< 0x00000001 */
#define ADC_CR1_AWDCH_1                (0x02UL << ADC_CR1_AWDCH_Pos)            /*!< 0x00000002 */
#define ADC_CR1_AWDCH_2                (0x04UL << ADC_CR1_AWDCH_Pos)            /*!< 0x00000004 */
#define ADC_CR1_AWDCH_3                (0x08UL << ADC_CR1_AWDCH_Pos)            /*!< 0x00000008 */
#define ADC_CR1_AWDCH_4                (0x10UL << ADC_CR1_AWDCH_Pos)            /*!< 0x00000010 */
#define ADC_CR1_EOCIE_Pos              (5U)                                    
#define ADC_CR1_EOCIE_Msk              (0x1UL << ADC_CR1_EOCIE_Pos)             /*!< 0x00000020 */
#define ADC_CR1_EOCIE                  ADC_CR1_EOCIE_Msk                       /*!< Interrupt enable for EOC */
#define ADC_CR1_AWDIE_Pos              (6U)                                    
#define ADC_CR1_AWDIE_Msk              (0x1UL << ADC_CR1_AWDIE_Pos)             /*!< 0x00000040 */
#define ADC_CR1_AWDIE                  ADC_CR1_AWDIE_Msk                       /*!< Analog Watchdog interrupt enable */
#define ADC_CR1_JEOCIE_Pos             (7U)                                    
#define ADC_CR1_JEOCIE_Msk             (0x1UL << ADC_CR1_JEOCIE_Pos)            /*!< 0x00000080 */
#define ADC_CR1_JEOCIE                 ADC_CR1_JEOCIE_Msk                      /*!< Interrupt enable for injected channels */
#define ADC_CR1_SCAN_Pos               (8U)                                    
#define ADC_CR1_SCAN_Msk               (0x1UL << ADC_CR1_SCAN_Pos)              /*!< 0x00000100 */
#define ADC_CR1_SCAN                   ADC_CR1_SCAN_Msk                        /*!< Scan mode */
#define ADC_CR1_AWDSGL_Pos             (9U)                                    
#define ADC_CR1_AWDSGL_Msk             (0x1UL << ADC_CR1_AWDSGL_Pos)            /*!< 0x00000200 */
#define ADC_CR1_AWDSGL                 ADC_CR1_AWDSGL_Msk                      /*!< Enable the watchdog on a single channel in scan mode */
#define ADC_CR1_JAUTO_Pos              (10U)                                   
#define ADC_CR1_JAUTO_Msk              (0x1UL << ADC_CR1_JAUTO_Pos)             /*!< 0x00000400 */
#define ADC_CR1_JAUTO                  ADC_CR1_JAUTO_Msk                       /*!< Automatic injected group conversion */
#define ADC_CR1_DISCEN_Pos             (11U)                                   
#define ADC_CR1_DISCEN_Msk             (0x1UL << ADC_CR1_DISCEN_Pos)            /*!< 0x00000800 */
#define ADC_CR1_DISCEN                 ADC_CR1_DISCEN_Msk                      /*!< Discontinuous mode on regular channels */
#define ADC_CR1_JDISCEN_Pos            (12U)                                   
#define ADC_CR1_JDISCEN_Msk            (0x1UL << ADC_CR1_JDISCEN_Pos)           /*!< 0x00001000 */
#define ADC_CR1_JDISCEN                ADC_CR1_JDISCEN_Msk                     /*!< Discontinuous mode on injected channels */
#define ADC_CR1_DISCNUM_Pos            (13U)                                   
#define ADC_CR1_DISCNUM_Msk            (0x7UL << ADC_CR1_DISCNUM_Pos)           /*!< 0x0000E000 */
#define ADC_CR1_DISCNUM                ADC_CR1_DISCNUM_Msk                     /*!< DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define ADC_CR1_DISCNUM_0              (0x1UL << ADC_CR1_DISCNUM_Pos)           /*!< 0x00002000 */
#define ADC_CR1_DISCNUM_1              (0x2UL << ADC_CR1_DISCNUM_Pos)           /*!< 0x00004000 */
#define ADC_CR1_DISCNUM_2              (0x4UL << ADC_CR1_DISCNUM_Pos)           /*!< 0x00008000 */
#define ADC_CR1_JAWDEN_Pos             (22U)                                   
#define ADC_CR1_JAWDEN_Msk             (0x1UL << ADC_CR1_JAWDEN_Pos)            /*!< 0x00400000 */
#define ADC_CR1_JAWDEN                 ADC_CR1_JAWDEN_Msk                      /*!< Analog watchdog enable on injected channels */
#define ADC_CR1_AWDEN_Pos              (23U)                                   
#define ADC_CR1_AWDEN_Msk              (0x1UL << ADC_CR1_AWDEN_Pos)             /*!< 0x00800000 */
#define ADC_CR1_AWDEN                  ADC_CR1_AWDEN_Msk                       /*!< Analog watchdog enable on regular channels */

/*******************  Bit definition for ADC_CR2 register  ********************/
#define ADC_CR2_ADON_Pos               (0U)                                    
#define ADC_CR2_ADON_Msk               (0x1UL << ADC_CR2_ADON_Pos)              /*!< 0x00000001 */
#define ADC_CR2_ADON                   ADC_CR2_ADON_Msk                        /*!< A/D Converter ON / OFF */
#define ADC_CR2_CONT_Pos               (1U)                                    
#define ADC_CR2_CONT_Msk               (0x1UL << ADC_CR2_CONT_Pos)              /*!< 0x00000002 */
#define ADC_CR2_CONT                   ADC_CR2_CONT_Msk                        /*!< Continuous Conversion */
#define ADC_CR2_CAL_Pos                (2U)                                    
#define ADC_CR2_CAL_Msk                (0x1UL << ADC_CR2_CAL_Pos)               /*!< 0x00000004 */
#define ADC_CR2_CAL                    ADC_CR2_CAL_Msk                         /*!< A/D Calibration */
#define ADC_CR2_RSTCAL_Pos             (3U)                                    
#define ADC_CR2_RSTCAL_Msk             (0x1UL << ADC_CR2_RSTCAL_Pos)            /*!< 0x00000008 */
#define ADC_CR2_RSTCAL                 ADC_CR2_RSTCAL_Msk                      /*!< Reset Calibration */
#define ADC_CR2_DMA_Pos                (8U)                                    
#define ADC_CR2_DMA_Msk                (0x1UL << ADC_CR2_DMA_Pos)               /*!< 0x00000100 */
#define ADC_CR2_DMA                    ADC_CR2_DMA_Msk                         /*!< Direct Memory access mode */
#define ADC_CR2_ALIGN_Pos              (11U)                                   
#define ADC_CR2_ALIGN_Msk              (0x1UL << ADC_CR2_ALIGN_Pos)             /*!< 0x00000800 */
#define ADC_CR2_ALIGN                  ADC_CR2_ALIGN_Msk                       /*!< Data Alignment */
#define ADC_CR2_JEXTSEL_Pos            (12U)                                   
#define ADC_CR2_JEXTSEL_Msk            (0x7UL << ADC_CR2_JEXTSEL_Pos)           /*!< 0x00007000 */
#define ADC_CR2_JEXTSEL                ADC_CR2_JEXTSEL_Msk                     /*!< JEXTSEL[2:0] bits (External event select for injected group) */
#define ADC_CR2_JEXTSEL_0              (0x1UL << ADC_CR2_JEXTSEL_Pos)           /*!< 0x00001000 */
#define ADC_CR2_JEXTSEL_1              (0x2UL << ADC_CR2_JEXTSEL_Pos)           /*!< 0x00002000 */
#define ADC_CR2_JEXTSEL_2              (0x4UL << ADC_CR2_JEXTSEL_Pos)           /*!< 0x00004000 */
#define ADC_CR2_JEXTTRIG_Pos           (15U)                                   
#define ADC_CR2_JEXTTRIG_Msk           (0x1UL << ADC_CR2_JEXTTRIG_Pos)          /*!< 0x00008000 */
#define ADC_CR2_JEXTTRIG               ADC_CR2_JEXTTRIG_Msk                    /*!< External Trigger Conversion mode for injected channels */
#define ADC_CR2_EXTSEL_Pos             (17U)                                   
#define ADC_CR2_EXTSEL_Msk             (0x7UL << ADC_CR2_EXTSEL_Pos)            /*!< 0x000E0000 */
#define ADC_CR2_EXTSEL                 ADC_CR2_EXTSEL_Msk                      /*!< EXTSEL[2:0] bits (External Event Select for regular group) */
#define ADC_CR2_EXTSEL_0               (0x1UL << ADC_CR2_EXTSEL_Pos)            /*!< 0x00020000 */
#define ADC_CR2_EXTSEL_1               (0x2UL << ADC_CR2_EXTSEL_Pos)            /*!< 0x00040000 */
#define ADC_CR2_EXTSEL_2               (0x4UL << ADC_CR2_EXTSEL_Pos)            /*!< 0x00080000 */
#define ADC_CR2_EXTTRIG_Pos            (20U)                                   
#define ADC_CR2_EXTTRIG_Msk            (0x1UL << ADC_CR2_EXTTRIG_Pos)           /*!< 0x00100000 */
#define ADC_CR2_EXTTRIG                ADC_CR2_EXTTRIG_Msk                     /*!< External Trigger Conversion mode for regular channels */
#define ADC_CR2_JSWSTART_Pos           (21U)                                   
#define ADC_CR2_JSWSTART_Msk           (0x1UL << ADC_CR2_JSWSTART_Pos)          /*!< 0x00200000 */
#define ADC_CR2_JSWSTART               ADC_CR2_JSWSTART_Msk                    /*!< Start Conversion of injected channels */
#define ADC_CR2_SWSTART_Pos            (22U)                                   
#define ADC_CR2_SWSTART_Msk            (0x1UL << ADC_CR2_SWSTART_Pos)           /*!< 0x00400000 */
#define ADC_CR2_SWSTART                ADC_CR2_SWSTART_Msk                     /*!< Start Conversion of regular channels */
#define ADC_CR2_TSVREFE_Pos            (23U)                                   
#define ADC_CR2_TSVREFE_Msk            (0x1UL << ADC_CR2_TSVREFE_Pos)           /*!< 0x00800000 */
#define ADC_CR2_TSVREFE                ADC_CR2_TSVREFE_Msk                     /*!< Temperature Sensor and VREFINT Enable */

/******************  Bit definition for ADC_SMPR1 register  *******************/
#define ADC_SMPR1_SMP10_Pos            (0U)                                    
#define ADC_SMPR1_SMP10_Msk            (0x7UL << ADC_SMPR1_SMP10_Pos)           /*!< 0x00000007 */
#define ADC_SMPR1_SMP10                ADC_SMPR1_SMP10_Msk                     /*!< SMP10[2:0] bits (Channel 10 Sample time selection) */
#define ADC_SMPR1_SMP10_0              (0x1UL << ADC_SMPR1_SMP10_Pos)           /*!< 0x00000001 */
#define ADC_SMPR1_SMP10_1              (0x2UL << ADC_SMPR1_SMP10_Pos)           /*!< 0x00000002 */
#define ADC_SMPR1_SMP10_2              (0x4UL << ADC_SMPR1_SMP10_Pos)           /*!< 0x00000004 */
#define ADC_SMPR1_SMP11_Pos            (3U)                                    
#define ADC_SMPR1_SMP11_Msk            (0x7UL << ADC_SMPR1_SMP11_Pos)           /*!< 0x00000038 */
#define ADC_SMPR1_SMP11                ADC_SMPR1_SMP11_Msk                     /*!< SMP11[2:0] bits (Channel 11 Sample time selection) */
#define ADC_SMPR1_SMP11_0              (0x1UL << ADC_SMPR1_SMP11_Pos)           /*!< 0x00000008 */
#define ADC_SMPR1_SMP11_1              (0x2UL << ADC_SMPR1_SMP11_Pos)           /*!< 0x00000010 */
#define ADC_SMPR1_SMP11_2              (0x4UL << ADC_SMPR1_SMP11_Pos)           /*!< 0x00000020 */
#define ADC_SMPR1_SMP12_Pos            (6U)                                    
#define ADC_SMPR1_SMP12_Msk            (0x7UL << ADC_SMPR1_SMP12_Pos)           /*!< 0x000001C0 */
#define ADC_SMPR1_SMP12                ADC_SMPR1_SMP12_Msk                     /*!< SMP12[2:0] bits (Channel 12 Sample time selection) */
#define ADC_SMPR1_SMP12_0              (0x1UL << ADC_SMPR1_SMP12_Pos)           /*!< 0x00000040 */
#define ADC_SMPR1_SMP12_1              (0x2UL << ADC_SMPR1_SMP12_Pos)           /*!< 0x00000080 */
#define ADC_SMPR1_SMP12_2              (0x4UL << ADC_SMPR1_SMP12_Pos)           /*!< 0x00000100 */
#define ADC_SMPR1_SMP13_Pos            (9U)                                    
#define ADC_SMPR1_SMP13_Msk            (0x7UL << ADC_SMPR1_SMP13_Pos)           /*!< 0x00000E00 */
#define ADC_SMPR1_SMP13                ADC_SMPR1_SMP13_Msk                     /*!< SMP13[2:0] bits (Channel 13 Sample time selection) */
#define ADC_SMPR1_SMP13_0              (0x1UL << ADC_SMPR1_SMP13_Pos)           /*!< 0x00000200 */
#define ADC_SMPR1_SMP13_1              (0x2UL << ADC_SMPR1_SMP13_Pos)           /*!< 0x00000400 */
#define ADC_SMPR1_SMP13_2              (0x4UL << ADC_SMPR1_SMP13_Pos)           /*!< 0x00000800 */
#define ADC_SMPR1_SMP14_Pos            (12U)                                   
#define ADC_SMPR1_SMP14_Msk            (0x7UL << ADC_SMPR1_SMP14_Pos)           /*!< 0x00007000 */
#define ADC_SMPR1_SMP14                ADC_SMPR1_SMP14_Msk                     /*!< SMP14[2:0] bits (Channel 14 Sample time selection) */
#define ADC_SMPR1_SMP14_0              (0x1UL << ADC_SMPR1_SMP14_Pos)           /*!< 0x00001000 */
#define ADC_SMPR1_SMP14_1              (0x2UL << ADC_SMPR1_SMP14_Pos)           /*!< 0x00002000 */
#define ADC_SMPR1_SMP14_2              (0x4UL << ADC_SMPR1_SMP14_Pos)           /*!< 0x00004000 */
#define ADC_SMPR1_SMP15_Pos            (15U)                                   
#define ADC_SMPR1_SMP15_Msk            (0x7UL << ADC_SMPR1_SMP15_Pos)           /*!< 0x00038000 */
#define ADC_SMPR1_SMP15                ADC_SMPR1_SMP15_Msk                     /*!< SMP15[2:0] bits (Channel 15 Sample time selection) */
#define ADC_SMPR1_SMP15_0              (0x1UL << ADC_SMPR1_SMP15_Pos)           /*!< 0x00008000 */
#define ADC_SMPR1_SMP15_1              (0x2UL << ADC_SMPR1_SMP15_Pos)           /*!< 0x00010000 */
#define ADC_SMPR1_SMP15_2              (0x4UL << ADC_SMPR1_SMP15_Pos)           /*!< 0x00020000 */
#define ADC_SMPR1_SMP16_Pos            (18U)                                   
#define ADC_SMPR1_SMP16_Msk            (0x7UL << ADC_SMPR1_SMP16_Pos)           /*!< 0x001C0000 */
#define ADC_SMPR1_SMP16                ADC_SMPR1_SMP16_Msk                     /*!< SMP16[2:0] bits (Channel 16 Sample time selection) */
#define ADC_SMPR1_SMP16_0              (0x1UL << ADC_SMPR1_SMP16_Pos)           /*!< 0x00040000 */
#define ADC_SMPR1_SMP16_1              (0x2UL << ADC_SMPR1_SMP16_Pos)           /*!< 0x00080000 */
#define ADC_SMPR1_SMP16_2              (0x4UL << ADC_SMPR1_SMP16_Pos)           /*!< 0x00100000 */
#define ADC_SMPR1_SMP17_Pos            (21U)                                   
#define ADC_SMPR1_SMP17_Msk            (0x7UL << ADC_SMPR1_SMP17_Pos)           /*!< 0x00E00000 */
#define ADC_SMPR1_SMP17                ADC_SMPR1_SMP17_Msk                     /*!< SMP17[2:0] bits (Channel 17 Sample time selection) */
#define ADC_SMPR1_SMP17_0              (0x1UL << ADC_SMPR1_SMP17_Pos)           /*!< 0x00200000 */
#define ADC_SMPR1_SMP17_1              (0x2UL << ADC_SMPR1_SMP17_Pos)           /*!< 0x00400000 */
#define ADC_SMPR1_SMP17_2              (0x4UL << ADC_SMPR1_SMP17_Pos)           /*!< 0x00800000 */
#define ADC_SMPR1_SMP18_Pos            (24U)                                   
#define ADC_SMPR1_SMP18_Msk            (0x7UL << ADC_SMPR1_SMP18_Pos)           /*!< 0x07000000 */
#define ADC_SMPR1_SMP18                ADC_SMPR1_SMP18_Msk                     /*!< SMP18[2:0] bits (Channel 18 Sample time selection) */
#define ADC_SMPR1_SMP18_0              (0x1UL << ADC_SMPR1_SMP18_Pos)           /*!< 0x01000000 */
#define ADC_SMPR1_SMP18_1              (0x2UL << ADC_SMPR1_SMP18_Pos)           /*!< 0x02000000 */
#define ADC_SMPR1_SMP18_2              (0x4UL << ADC_SMPR1_SMP18_Pos)           /*!< 0x04000000 */

