MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F373RB/mcu.h
/******************  Bit definition for ADC_SMPR2 register  *******************/
#define ADC_SMPR2_SMP0_Pos             (0U)                                    
#define ADC_SMPR2_SMP0_Msk             (0x7UL << ADC_SMPR2_SMP0_Pos)            /*!< 0x00000007 */
#define ADC_SMPR2_SMP0                 ADC_SMPR2_SMP0_Msk                      /*!< SMP0[2:0] bits (Channel 0 Sample time selection) */
#define ADC_SMPR2_SMP0_0               (0x1UL << ADC_SMPR2_SMP0_Pos)            /*!< 0x00000001 */
#define ADC_SMPR2_SMP0_1               (0x2UL << ADC_SMPR2_SMP0_Pos)            /*!< 0x00000002 */
#define ADC_SMPR2_SMP0_2               (0x4UL << ADC_SMPR2_SMP0_Pos)            /*!< 0x00000004 */
#define ADC_SMPR2_SMP1_Pos             (3U)                                    
#define ADC_SMPR2_SMP1_Msk             (0x7UL << ADC_SMPR2_SMP1_Pos)            /*!< 0x00000038 */
#define ADC_SMPR2_SMP1                 ADC_SMPR2_SMP1_Msk                      /*!< SMP1[2:0] bits (Channel 1 Sample time selection) */
#define ADC_SMPR2_SMP1_0               (0x1UL << ADC_SMPR2_SMP1_Pos)            /*!< 0x00000008 */
#define ADC_SMPR2_SMP1_1               (0x2UL << ADC_SMPR2_SMP1_Pos)            /*!< 0x00000010 */
#define ADC_SMPR2_SMP1_2               (0x4UL << ADC_SMPR2_SMP1_Pos)            /*!< 0x00000020 */
#define ADC_SMPR2_SMP2_Pos             (6U)                                    
#define ADC_SMPR2_SMP2_Msk             (0x7UL << ADC_SMPR2_SMP2_Pos)            /*!< 0x000001C0 */
#define ADC_SMPR2_SMP2                 ADC_SMPR2_SMP2_Msk                      /*!< SMP2[2:0] bits (Channel 2 Sample time selection) */
#define ADC_SMPR2_SMP2_0               (0x1UL << ADC_SMPR2_SMP2_Pos)            /*!< 0x00000040 */
#define ADC_SMPR2_SMP2_1               (0x2UL << ADC_SMPR2_SMP2_Pos)            /*!< 0x00000080 */
#define ADC_SMPR2_SMP2_2               (0x4UL << ADC_SMPR2_SMP2_Pos)            /*!< 0x00000100 */
#define ADC_SMPR2_SMP3_Pos             (9U)                                    
#define ADC_SMPR2_SMP3_Msk             (0x7UL << ADC_SMPR2_SMP3_Pos)            /*!< 0x00000E00 */
#define ADC_SMPR2_SMP3                 ADC_SMPR2_SMP3_Msk                      /*!< SMP3[2:0] bits (Channel 3 Sample time selection) */
#define ADC_SMPR2_SMP3_0               (0x1UL << ADC_SMPR2_SMP3_Pos)            /*!< 0x00000200 */
#define ADC_SMPR2_SMP3_1               (0x2UL << ADC_SMPR2_SMP3_Pos)            /*!< 0x00000400 */
#define ADC_SMPR2_SMP3_2               (0x4UL << ADC_SMPR2_SMP3_Pos)            /*!< 0x00000800 */
#define ADC_SMPR2_SMP4_Pos             (12U)                                   
#define ADC_SMPR2_SMP4_Msk             (0x7UL << ADC_SMPR2_SMP4_Pos)            /*!< 0x00007000 */
#define ADC_SMPR2_SMP4                 ADC_SMPR2_SMP4_Msk                      /*!< SMP4[2:0] bits (Channel 4 Sample time selection) */
#define ADC_SMPR2_SMP4_0               (0x1UL << ADC_SMPR2_SMP4_Pos)            /*!< 0x00001000 */
#define ADC_SMPR2_SMP4_1               (0x2UL << ADC_SMPR2_SMP4_Pos)            /*!< 0x00002000 */
#define ADC_SMPR2_SMP4_2               (0x4UL << ADC_SMPR2_SMP4_Pos)            /*!< 0x00004000 */
#define ADC_SMPR2_SMP5_Pos             (15U)                                   
#define ADC_SMPR2_SMP5_Msk             (0x7UL << ADC_SMPR2_SMP5_Pos)            /*!< 0x00038000 */
#define ADC_SMPR2_SMP5                 ADC_SMPR2_SMP5_Msk                      /*!< SMP5[2:0] bits (Channel 5 Sample time selection) */
#define ADC_SMPR2_SMP5_0               (0x1UL << ADC_SMPR2_SMP5_Pos)            /*!< 0x00008000 */
#define ADC_SMPR2_SMP5_1               (0x2UL << ADC_SMPR2_SMP5_Pos)            /*!< 0x00010000 */
#define ADC_SMPR2_SMP5_2               (0x4UL << ADC_SMPR2_SMP5_Pos)            /*!< 0x00020000 */
#define ADC_SMPR2_SMP6_Pos             (18U)                                   
#define ADC_SMPR2_SMP6_Msk             (0x7UL << ADC_SMPR2_SMP6_Pos)            /*!< 0x001C0000 */
#define ADC_SMPR2_SMP6                 ADC_SMPR2_SMP6_Msk                      /*!< SMP6[2:0] bits (Channel 6 Sample time selection) */
#define ADC_SMPR2_SMP6_0               (0x1UL << ADC_SMPR2_SMP6_Pos)            /*!< 0x00040000 */
#define ADC_SMPR2_SMP6_1               (0x2UL << ADC_SMPR2_SMP6_Pos)            /*!< 0x00080000 */
#define ADC_SMPR2_SMP6_2               (0x4UL << ADC_SMPR2_SMP6_Pos)            /*!< 0x00100000 */
#define ADC_SMPR2_SMP7_Pos             (21U)                                   
#define ADC_SMPR2_SMP7_Msk             (0x7UL << ADC_SMPR2_SMP7_Pos)            /*!< 0x00E00000 */
#define ADC_SMPR2_SMP7                 ADC_SMPR2_SMP7_Msk                      /*!< SMP7[2:0] bits (Channel 7 Sample time selection) */
#define ADC_SMPR2_SMP7_0               (0x1UL << ADC_SMPR2_SMP7_Pos)            /*!< 0x00200000 */
#define ADC_SMPR2_SMP7_1               (0x2UL << ADC_SMPR2_SMP7_Pos)            /*!< 0x00400000 */
#define ADC_SMPR2_SMP7_2               (0x4UL << ADC_SMPR2_SMP7_Pos)            /*!< 0x00800000 */
#define ADC_SMPR2_SMP8_Pos             (24U)                                   
#define ADC_SMPR2_SMP8_Msk             (0x7UL << ADC_SMPR2_SMP8_Pos)            /*!< 0x07000000 */
#define ADC_SMPR2_SMP8                 ADC_SMPR2_SMP8_Msk                      /*!< SMP8[2:0] bits (Channel 8 Sample time selection) */
#define ADC_SMPR2_SMP8_0               (0x1UL << ADC_SMPR2_SMP8_Pos)            /*!< 0x01000000 */
#define ADC_SMPR2_SMP8_1               (0x2UL << ADC_SMPR2_SMP8_Pos)            /*!< 0x02000000 */
#define ADC_SMPR2_SMP8_2               (0x4UL << ADC_SMPR2_SMP8_Pos)            /*!< 0x04000000 */
#define ADC_SMPR2_SMP9_Pos             (27U)                                   
#define ADC_SMPR2_SMP9_Msk             (0x7UL << ADC_SMPR2_SMP9_Pos)            /*!< 0x38000000 */
#define ADC_SMPR2_SMP9                 ADC_SMPR2_SMP9_Msk                      /*!< SMP9[2:0] bits (Channel 9 Sample time selection) */
#define ADC_SMPR2_SMP9_0               (0x1UL << ADC_SMPR2_SMP9_Pos)            /*!< 0x08000000 */
#define ADC_SMPR2_SMP9_1               (0x2UL << ADC_SMPR2_SMP9_Pos)            /*!< 0x10000000 */
#define ADC_SMPR2_SMP9_2               (0x4UL << ADC_SMPR2_SMP9_Pos)            /*!< 0x20000000 */

/******************  Bit definition for ADC_JOFR1 register  *******************/
#define ADC_JOFR1_JOFFSET1_Pos         (0U)                                    
#define ADC_JOFR1_JOFFSET1_Msk         (0xFFFUL << ADC_JOFR1_JOFFSET1_Pos)      /*!< 0x00000FFF */
#define ADC_JOFR1_JOFFSET1             ADC_JOFR1_JOFFSET1_Msk                  /*!< Data offset for injected channel 1 */

/******************  Bit definition for ADC_JOFR2 register  *******************/
#define ADC_JOFR2_JOFFSET2_Pos         (0U)                                    
#define ADC_JOFR2_JOFFSET2_Msk         (0xFFFUL << ADC_JOFR2_JOFFSET2_Pos)      /*!< 0x00000FFF */
#define ADC_JOFR2_JOFFSET2             ADC_JOFR2_JOFFSET2_Msk                  /*!< Data offset for injected channel 2 */

/******************  Bit definition for ADC_JOFR3 register  *******************/
#define ADC_JOFR3_JOFFSET3_Pos         (0U)                                    
#define ADC_JOFR3_JOFFSET3_Msk         (0xFFFUL << ADC_JOFR3_JOFFSET3_Pos)      /*!< 0x00000FFF */
#define ADC_JOFR3_JOFFSET3             ADC_JOFR3_JOFFSET3_Msk                  /*!< Data offset for injected channel 3 */

/******************  Bit definition for ADC_JOFR4 register  *******************/
#define ADC_JOFR4_JOFFSET4_Pos         (0U)                                    
#define ADC_JOFR4_JOFFSET4_Msk         (0xFFFUL << ADC_JOFR4_JOFFSET4_Pos)      /*!< 0x00000FFF */
#define ADC_JOFR4_JOFFSET4             ADC_JOFR4_JOFFSET4_Msk                  /*!< Data offset for injected channel 4 */

