MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F373RB/mcu.h
/********************  Bit definition for ADC_DR register  ********************/
#define ADC_DR_DATA_Pos                (0U)                                    
#define ADC_DR_DATA_Msk                (0xFFFFUL << ADC_DR_DATA_Pos)            /*!< 0x0000FFFF */
#define ADC_DR_DATA                    ADC_DR_DATA_Msk                         /*!< Regular data */

/******************************************************************************/
/*                                                                            */
/*                      Analog Comparators (COMP)                             */
/*                                                                            */
/******************************************************************************/

#define COMP_V1_1_0_0                                  /*!< Comparator IP version */

/***********************  Bit definition for COMP_CSR register  ***************/
/* COMP1 bits definition */
#define COMP_CSR_COMP1EN_Pos            (0U)                                   
#define COMP_CSR_COMP1EN_Msk            (0x1UL << COMP_CSR_COMP1EN_Pos)         /*!< 0x00000001 */
#define COMP_CSR_COMP1EN                COMP_CSR_COMP1EN_Msk                   /*!< COMP1 enable */
#define COMP_CSR_COMP1SW1_Pos           (1U)                                   
#define COMP_CSR_COMP1SW1_Msk           (0x1UL << COMP_CSR_COMP1SW1_Pos)        /*!< 0x00000002 */
#define COMP_CSR_COMP1SW1               COMP_CSR_COMP1SW1_Msk                  /*!< SW1 switch control */
#define COMP_CSR_COMP1MODE_Pos          (2U)                                   
#define COMP_CSR_COMP1MODE_Msk          (0x3UL << COMP_CSR_COMP1MODE_Pos)       /*!< 0x0000000C */
#define COMP_CSR_COMP1MODE              COMP_CSR_COMP1MODE_Msk                 /*!< COMP1 power mode */
#define COMP_CSR_COMP1MODE_0            (0x1UL << COMP_CSR_COMP1MODE_Pos)       /*!< 0x00000004 */
#define COMP_CSR_COMP1MODE_1            (0x2UL << COMP_CSR_COMP1MODE_Pos)       /*!< 0x00000008 */
#define COMP_CSR_COMP1INSEL_Pos         (4U)                                   
#define COMP_CSR_COMP1INSEL_Msk         (0x7UL << COMP_CSR_COMP1INSEL_Pos)      /*!< 0x00000070 */
#define COMP_CSR_COMP1INSEL             COMP_CSR_COMP1INSEL_Msk                /*!< COMP1 inverting input select */
#define COMP_CSR_COMP1INSEL_0           (0x1UL << COMP_CSR_COMP1INSEL_Pos)      /*!< 0x00000010 */
#define COMP_CSR_COMP1INSEL_1           (0x2UL << COMP_CSR_COMP1INSEL_Pos)      /*!< 0x00000020 */
#define COMP_CSR_COMP1INSEL_2           (0x4UL << COMP_CSR_COMP1INSEL_Pos)      /*!< 0x00000040 */
#define COMP_CSR_COMP1OUTSEL_Pos        (8U)                                   
#define COMP_CSR_COMP1OUTSEL_Msk        (0x7UL << COMP_CSR_COMP1OUTSEL_Pos)     /*!< 0x00000700 */
#define COMP_CSR_COMP1OUTSEL            COMP_CSR_COMP1OUTSEL_Msk               /*!< COMP1 output select */
#define COMP_CSR_COMP1OUTSEL_0          (0x1UL << COMP_CSR_COMP1OUTSEL_Pos)     /*!< 0x00000100 */
#define COMP_CSR_COMP1OUTSEL_1          (0x2UL << COMP_CSR_COMP1OUTSEL_Pos)     /*!< 0x00000200 */
#define COMP_CSR_COMP1OUTSEL_2          (0x4UL << COMP_CSR_COMP1OUTSEL_Pos)     /*!< 0x00000400 */
#define COMP_CSR_COMP1POL_Pos           (11U)                                  
#define COMP_CSR_COMP1POL_Msk           (0x1UL << COMP_CSR_COMP1POL_Pos)        /*!< 0x00000800 */
#define COMP_CSR_COMP1POL               COMP_CSR_COMP1POL_Msk                  /*!< COMP1 output polarity */
#define COMP_CSR_COMP1HYST_Pos          (12U)                                  
#define COMP_CSR_COMP1HYST_Msk          (0x3UL << COMP_CSR_COMP1HYST_Pos)       /*!< 0x00003000 */
#define COMP_CSR_COMP1HYST              COMP_CSR_COMP1HYST_Msk                 /*!< COMP1 hysteresis */
#define COMP_CSR_COMP1HYST_0            (0x1UL << COMP_CSR_COMP1HYST_Pos)       /*!< 0x00001000 */
#define COMP_CSR_COMP1HYST_1            (0x2UL << COMP_CSR_COMP1HYST_Pos)       /*!< 0x00002000 */
#define COMP_CSR_COMP1OUT_Pos           (14U)                                  
#define COMP_CSR_COMP1OUT_Msk           (0x1UL << COMP_CSR_COMP1OUT_Pos)        /*!< 0x00004000 */
#define COMP_CSR_COMP1OUT               COMP_CSR_COMP1OUT_Msk                  /*!< COMP1 output level */
#define COMP_CSR_COMP1LOCK_Pos          (15U)                                  
#define COMP_CSR_COMP1LOCK_Msk          (0x1UL << COMP_CSR_COMP1LOCK_Pos)       /*!< 0x00008000 */
#define COMP_CSR_COMP1LOCK              COMP_CSR_COMP1LOCK_Msk                 /*!< COMP1 lock */
/* COMP2 bits definition */
#define COMP_CSR_COMP2EN_Pos            (16U)                                  
#define COMP_CSR_COMP2EN_Msk            (0x1UL << COMP_CSR_COMP2EN_Pos)         /*!< 0x00010000 */
#define COMP_CSR_COMP2EN                COMP_CSR_COMP2EN_Msk                   /*!< COMP2 enable */
#define COMP_CSR_COMP2MODE_Pos          (18U)                                  
#define COMP_CSR_COMP2MODE_Msk          (0x3UL << COMP_CSR_COMP2MODE_Pos)       /*!< 0x000C0000 */
#define COMP_CSR_COMP2MODE              COMP_CSR_COMP2MODE_Msk                 /*!< COMP2 power mode */
#define COMP_CSR_COMP2MODE_0            (0x1UL << COMP_CSR_COMP2MODE_Pos)       /*!< 0x00040000 */
#define COMP_CSR_COMP2MODE_1            (0x2UL << COMP_CSR_COMP2MODE_Pos)       /*!< 0x00080000 */
#define COMP_CSR_COMP2INSEL_Pos         (20U)                                  
#define COMP_CSR_COMP2INSEL_Msk         (0x7UL << COMP_CSR_COMP2INSEL_Pos)      /*!< 0x00700000 */
#define COMP_CSR_COMP2INSEL             COMP_CSR_COMP2INSEL_Msk                /*!< COMP2 inverting input select */
#define COMP_CSR_COMP2INSEL_0           (0x1UL << COMP_CSR_COMP2INSEL_Pos)      /*!< 0x00100000 */
#define COMP_CSR_COMP2INSEL_1           (0x2UL << COMP_CSR_COMP2INSEL_Pos)      /*!< 0x00200000 */
#define COMP_CSR_COMP2INSEL_2           (0x4UL << COMP_CSR_COMP2INSEL_Pos)      /*!< 0x00400000 */
#define COMP_CSR_WNDWEN_Pos             (23U)                                  
#define COMP_CSR_WNDWEN_Msk             (0x1UL << COMP_CSR_WNDWEN_Pos)          /*!< 0x00800000 */
#define COMP_CSR_WNDWEN                 COMP_CSR_WNDWEN_Msk                    /*!< Comparators window mode enable */
#define COMP_CSR_COMP2OUTSEL_Pos        (24U)                                  
#define COMP_CSR_COMP2OUTSEL_Msk        (0x7UL << COMP_CSR_COMP2OUTSEL_Pos)     /*!< 0x07000000 */
#define COMP_CSR_COMP2OUTSEL            COMP_CSR_COMP2OUTSEL_Msk               /*!< COMP2 output select */
#define COMP_CSR_COMP2OUTSEL_0          (0x1UL << COMP_CSR_COMP2OUTSEL_Pos)     /*!< 0x01000000 */
#define COMP_CSR_COMP2OUTSEL_1          (0x2UL << COMP_CSR_COMP2OUTSEL_Pos)     /*!< 0x02000000 */
#define COMP_CSR_COMP2OUTSEL_2          (0x4UL << COMP_CSR_COMP2OUTSEL_Pos)     /*!< 0x04000000 */
#define COMP_CSR_COMP2POL_Pos           (27U)                                  
#define COMP_CSR_COMP2POL_Msk           (0x1UL << COMP_CSR_COMP2POL_Pos)        /*!< 0x08000000 */
#define COMP_CSR_COMP2POL               COMP_CSR_COMP2POL_Msk                  /*!< COMP2 output polarity */
#define COMP_CSR_COMP2HYST_Pos          (28U)                                  
#define COMP_CSR_COMP2HYST_Msk          (0x3UL << COMP_CSR_COMP2HYST_Pos)       /*!< 0x30000000 */
#define COMP_CSR_COMP2HYST              COMP_CSR_COMP2HYST_Msk                 /*!< COMP2 hysteresis */
#define COMP_CSR_COMP2HYST_0            (0x1UL << COMP_CSR_COMP2HYST_Pos)       /*!< 0x10000000 */
#define COMP_CSR_COMP2HYST_1            (0x2UL << COMP_CSR_COMP2HYST_Pos)       /*!< 0x20000000 */
#define COMP_CSR_COMP2OUT_Pos           (30U)                                  
#define COMP_CSR_COMP2OUT_Msk           (0x1UL << COMP_CSR_COMP2OUT_Pos)        /*!< 0x40000000 */
#define COMP_CSR_COMP2OUT               COMP_CSR_COMP2OUT_Msk                  /*!< COMP2 output level */
#define COMP_CSR_COMP2LOCK_Pos          (31U)                                  
#define COMP_CSR_COMP2LOCK_Msk          (0x1UL << COMP_CSR_COMP2LOCK_Pos)       /*!< 0x80000000 */
#define COMP_CSR_COMP2LOCK              COMP_CSR_COMP2LOCK_Msk                 /*!< COMP2 lock */
/* COMPx bits definition */
#define COMP_CSR_COMPxEN_Pos            (0U)                                   
#define COMP_CSR_COMPxEN_Msk            (0x1UL << COMP_CSR_COMPxEN_Pos)         /*!< 0x00000001 */
#define COMP_CSR_COMPxEN                COMP_CSR_COMPxEN_Msk                   /*!< COMPx enable */
#define COMP_CSR_COMPxSW1_Pos           (1U)                                   
#define COMP_CSR_COMPxSW1_Msk           (0x1UL << COMP_CSR_COMPxSW1_Pos)        /*!< 0x00000002 */
#define COMP_CSR_COMPxSW1               COMP_CSR_COMPxSW1_Msk                  /*!< COMPx SW1 switch control */
#define COMP_CSR_COMPxMODE_Pos          (2U)                                   
#define COMP_CSR_COMPxMODE_Msk          (0x3UL << COMP_CSR_COMPxMODE_Pos)       /*!< 0x0000000C */
#define COMP_CSR_COMPxMODE              COMP_CSR_COMPxMODE_Msk                 /*!< COMPx power mode */
#define COMP_CSR_COMPxMODE_0            (0x1UL << COMP_CSR_COMPxMODE_Pos)       /*!< 0x00000004 */
#define COMP_CSR_COMPxMODE_1            (0x2UL << COMP_CSR_COMPxMODE_Pos)       /*!< 0x00000008 */
#define COMP_CSR_COMPxINSEL_Pos         (4U)                                   
#define COMP_CSR_COMPxINSEL_Msk         (0x7UL << COMP_CSR_COMPxINSEL_Pos)      /*!< 0x00000070 */
#define COMP_CSR_COMPxINSEL             COMP_CSR_COMPxINSEL_Msk                /*!< COMPx inverting input select */
#define COMP_CSR_COMPxINSEL_0           (0x1UL << COMP_CSR_COMPxINSEL_Pos)      /*!< 0x00000010 */
#define COMP_CSR_COMPxINSEL_1           (0x2UL << COMP_CSR_COMPxINSEL_Pos)      /*!< 0x00000020 */
#define COMP_CSR_COMPxINSEL_2           (0x4UL << COMP_CSR_COMPxINSEL_Pos)      /*!< 0x00000040 */
#define COMP_CSR_COMPxWNDWEN_Pos        (7U)                                   
#define COMP_CSR_COMPxWNDWEN_Msk        (0x1UL << COMP_CSR_COMPxWNDWEN_Pos)     /*!< 0x00000080 */
#define COMP_CSR_COMPxWNDWEN            COMP_CSR_COMPxWNDWEN_Msk               /*!< COMPx window mode enable */
#define COMP_CSR_COMPxOUTSEL_Pos        (8U)                                   
#define COMP_CSR_COMPxOUTSEL_Msk        (0x7UL << COMP_CSR_COMPxOUTSEL_Pos)     /*!< 0x00000700 */
#define COMP_CSR_COMPxOUTSEL            COMP_CSR_COMPxOUTSEL_Msk               /*!< COMPx output select */
#define COMP_CSR_COMPxOUTSEL_0          (0x1UL << COMP_CSR_COMPxOUTSEL_Pos)     /*!< 0x00000100 */
#define COMP_CSR_COMPxOUTSEL_1          (0x2UL << COMP_CSR_COMPxOUTSEL_Pos)     /*!< 0x00000200 */
#define COMP_CSR_COMPxOUTSEL_2          (0x4UL << COMP_CSR_COMPxOUTSEL_Pos)     /*!< 0x00000400 */
#define COMP_CSR_COMPxPOL_Pos           (11U)                                  
#define COMP_CSR_COMPxPOL_Msk           (0x1UL << COMP_CSR_COMPxPOL_Pos)        /*!< 0x00000800 */
#define COMP_CSR_COMPxPOL               COMP_CSR_COMPxPOL_Msk                  /*!< COMPx output polarity */
#define COMP_CSR_COMPxHYST_Pos          (12U)                                  
#define COMP_CSR_COMPxHYST_Msk          (0x3UL << COMP_CSR_COMPxHYST_Pos)       /*!< 0x00003000 */
#define COMP_CSR_COMPxHYST              COMP_CSR_COMPxHYST_Msk                 /*!< COMPx hysteresis */
#define COMP_CSR_COMPxHYST_0            (0x1UL << COMP_CSR_COMPxHYST_Pos)       /*!< 0x00001000 */
#define COMP_CSR_COMPxHYST_1            (0x2UL << COMP_CSR_COMPxHYST_Pos)       /*!< 0x00002000 */
#define COMP_CSR_COMPxOUT_Pos           (14U)                                  
#define COMP_CSR_COMPxOUT_Msk           (0x1UL << COMP_CSR_COMPxOUT_Pos)        /*!< 0x00004000 */
#define COMP_CSR_COMPxOUT               COMP_CSR_COMPxOUT_Msk                  /*!< COMPx output level */
#define COMP_CSR_COMPxLOCK_Pos          (15U)                                  
#define COMP_CSR_COMPxLOCK_Msk          (0x1UL << COMP_CSR_COMPxLOCK_Pos)       /*!< 0x00008000 */
#define COMP_CSR_COMPxLOCK              COMP_CSR_COMPxLOCK_Msk                 /*!< COMPx lock */

/******************************************************************************/
/*                                                                            */
/*                   Controller Area Network (CAN )                           */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CAN_MCR register  ********************/
#define CAN_MCR_INRQ_Pos       (0U)                                            
#define CAN_MCR_INRQ_Msk       (0x1UL << CAN_MCR_INRQ_Pos)                      /*!< 0x00000001 */
#define CAN_MCR_INRQ           CAN_MCR_INRQ_Msk                                /*!<Initialization Request */
#define CAN_MCR_SLEEP_Pos      (1U)                                            
#define CAN_MCR_SLEEP_Msk      (0x1UL << CAN_MCR_SLEEP_Pos)                     /*!< 0x00000002 */
#define CAN_MCR_SLEEP          CAN_MCR_SLEEP_Msk                               /*!<Sleep Mode Request */
#define CAN_MCR_TXFP_Pos       (2U)                                            
#define CAN_MCR_TXFP_Msk       (0x1UL << CAN_MCR_TXFP_Pos)                      /*!< 0x00000004 */
#define CAN_MCR_TXFP           CAN_MCR_TXFP_Msk                                /*!<Transmit FIFO Priority */
#define CAN_MCR_RFLM_Pos       (3U)                                            
#define CAN_MCR_RFLM_Msk       (0x1UL << CAN_MCR_RFLM_Pos)                      /*!< 0x00000008 */
#define CAN_MCR_RFLM           CAN_MCR_RFLM_Msk                                /*!<Receive FIFO Locked Mode */
#define CAN_MCR_NART_Pos       (4U)                                            
#define CAN_MCR_NART_Msk       (0x1UL << CAN_MCR_NART_Pos)                      /*!< 0x00000010 */
#define CAN_MCR_NART           CAN_MCR_NART_Msk                                /*!<No Automatic Retransmission */
#define CAN_MCR_AWUM_Pos       (5U)                                            
#define CAN_MCR_AWUM_Msk       (0x1UL << CAN_MCR_AWUM_Pos)                      /*!< 0x00000020 */
#define CAN_MCR_AWUM           CAN_MCR_AWUM_Msk                                /*!<Automatic Wakeup Mode */
#define CAN_MCR_ABOM_Pos       (6U)                                            
#define CAN_MCR_ABOM_Msk       (0x1UL << CAN_MCR_ABOM_Pos)                      /*!< 0x00000040 */
#define CAN_MCR_ABOM           CAN_MCR_ABOM_Msk                                /*!<Automatic Bus-Off Management */
#define CAN_MCR_TTCM_Pos       (7U)                                            
#define CAN_MCR_TTCM_Msk       (0x1UL << CAN_MCR_TTCM_Pos)                      /*!< 0x00000080 */
#define CAN_MCR_TTCM           CAN_MCR_TTCM_Msk                                /*!<Time Triggered Communication Mode */
#define CAN_MCR_RESET_Pos      (15U)                                           
#define CAN_MCR_RESET_Msk      (0x1UL << CAN_MCR_RESET_Pos)                     /*!< 0x00008000 */
#define CAN_MCR_RESET          CAN_MCR_RESET_Msk                               /*!<bxCAN software master reset */

/*******************  Bit definition for CAN_MSR register  ********************/
#define CAN_MSR_INAK_Pos       (0U)                                            
#define CAN_MSR_INAK_Msk       (0x1UL << CAN_MSR_INAK_Pos)                      /*!< 0x00000001 */
#define CAN_MSR_INAK           CAN_MSR_INAK_Msk                                /*!<Initialization Acknowledge */
#define CAN_MSR_SLAK_Pos       (1U)                                            
#define CAN_MSR_SLAK_Msk       (0x1UL << CAN_MSR_SLAK_Pos)                      /*!< 0x00000002 */
#define CAN_MSR_SLAK           CAN_MSR_SLAK_Msk                                /*!<Sleep Acknowledge */
#define CAN_MSR_ERRI_Pos       (2U)                                            
#define CAN_MSR_ERRI_Msk       (0x1UL << CAN_MSR_ERRI_Pos)                      /*!< 0x00000004 */
#define CAN_MSR_ERRI           CAN_MSR_ERRI_Msk                                /*!<Error Interrupt */
#define CAN_MSR_WKUI_Pos       (3U)                                            
#define CAN_MSR_WKUI_Msk       (0x1UL << CAN_MSR_WKUI_Pos)                      /*!< 0x00000008 */
#define CAN_MSR_WKUI           CAN_MSR_WKUI_Msk                                /*!<Wakeup Interrupt */
#define CAN_MSR_SLAKI_Pos      (4U)                                            
#define CAN_MSR_SLAKI_Msk      (0x1UL << CAN_MSR_SLAKI_Pos)                     /*!< 0x00000010 */
#define CAN_MSR_SLAKI          CAN_MSR_SLAKI_Msk                               /*!<Sleep Acknowledge Interrupt */
#define CAN_MSR_TXM_Pos        (8U)                                            
#define CAN_MSR_TXM_Msk        (0x1UL << CAN_MSR_TXM_Pos)                       /*!< 0x00000100 */
#define CAN_MSR_TXM            CAN_MSR_TXM_Msk                                 /*!<Transmit Mode */
#define CAN_MSR_RXM_Pos        (9U)                                            
#define CAN_MSR_RXM_Msk        (0x1UL << CAN_MSR_RXM_Pos)                       /*!< 0x00000200 */
#define CAN_MSR_RXM            CAN_MSR_RXM_Msk                                 /*!<Receive Mode */
#define CAN_MSR_SAMP_Pos       (10U)                                           
#define CAN_MSR_SAMP_Msk       (0x1UL << CAN_MSR_SAMP_Pos)                      /*!< 0x00000400 */
#define CAN_MSR_SAMP           CAN_MSR_SAMP_Msk                                /*!<Last Sample Point */
#define CAN_MSR_RX_Pos         (11U)                                           
#define CAN_MSR_RX_Msk         (0x1UL << CAN_MSR_RX_Pos)                        /*!< 0x00000800 */
#define CAN_MSR_RX             CAN_MSR_RX_Msk                                  /*!<CAN Rx Signal */

/*******************  Bit definition for CAN_TSR register  ********************/
#define CAN_TSR_RQCP0_Pos      (0U)                                            
#define CAN_TSR_RQCP0_Msk      (0x1UL << CAN_TSR_RQCP0_Pos)                     /*!< 0x00000001 */
#define CAN_TSR_RQCP0          CAN_TSR_RQCP0_Msk                               /*!<Request Completed Mailbox0 */
#define CAN_TSR_TXOK0_Pos      (1U)                                            
#define CAN_TSR_TXOK0_Msk      (0x1UL << CAN_TSR_TXOK0_Pos)                     /*!< 0x00000002 */
#define CAN_TSR_TXOK0          CAN_TSR_TXOK0_Msk                               /*!<Transmission OK of Mailbox0 */
#define CAN_TSR_ALST0_Pos      (2U)                                            
#define CAN_TSR_ALST0_Msk      (0x1UL << CAN_TSR_ALST0_Pos)                     /*!< 0x00000004 */
#define CAN_TSR_ALST0          CAN_TSR_ALST0_Msk                               /*!<Arbitration Lost for Mailbox0 */
#define CAN_TSR_TERR0_Pos      (3U)                                            
#define CAN_TSR_TERR0_Msk      (0x1UL << CAN_TSR_TERR0_Pos)                     /*!< 0x00000008 */
#define CAN_TSR_TERR0          CAN_TSR_TERR0_Msk                               /*!<Transmission Error of Mailbox0 */
#define CAN_TSR_ABRQ0_Pos      (7U)                                            
#define CAN_TSR_ABRQ0_Msk      (0x1UL << CAN_TSR_ABRQ0_Pos)                     /*!< 0x00000080 */
#define CAN_TSR_ABRQ0          CAN_TSR_ABRQ0_Msk                               /*!<Abort Request for Mailbox0 */
#define CAN_TSR_RQCP1_Pos      (8U)                                            
#define CAN_TSR_RQCP1_Msk      (0x1UL << CAN_TSR_RQCP1_Pos)                     /*!< 0x00000100 */
#define CAN_TSR_RQCP1          CAN_TSR_RQCP1_Msk                               /*!<Request Completed Mailbox1 */
#define CAN_TSR_TXOK1_Pos      (9U)                                            
#define CAN_TSR_TXOK1_Msk      (0x1UL << CAN_TSR_TXOK1_Pos)                     /*!< 0x00000200 */
#define CAN_TSR_TXOK1          CAN_TSR_TXOK1_Msk                               /*!<Transmission OK of Mailbox1 */
#define CAN_TSR_ALST1_Pos      (10U)                                           
#define CAN_TSR_ALST1_Msk      (0x1UL << CAN_TSR_ALST1_Pos)                     /*!< 0x00000400 */
#define CAN_TSR_ALST1          CAN_TSR_ALST1_Msk                               /*!<Arbitration Lost for Mailbox1 */
#define CAN_TSR_TERR1_Pos      (11U)                                           
#define CAN_TSR_TERR1_Msk      (0x1UL << CAN_TSR_TERR1_Pos)                     /*!< 0x00000800 */
#define CAN_TSR_TERR1          CAN_TSR_TERR1_Msk                               /*!<Transmission Error of Mailbox1 */
#define CAN_TSR_ABRQ1_Pos      (15U)                                           
#define CAN_TSR_ABRQ1_Msk      (0x1UL << CAN_TSR_ABRQ1_Pos)                     /*!< 0x00008000 */
#define CAN_TSR_ABRQ1          CAN_TSR_ABRQ1_Msk                               /*!<Abort Request for Mailbox 1 */
#define CAN_TSR_RQCP2_Pos      (16U)                                           
#define CAN_TSR_RQCP2_Msk      (0x1UL << CAN_TSR_RQCP2_Pos)                     /*!< 0x00010000 */
#define CAN_TSR_RQCP2          CAN_TSR_RQCP2_Msk                               /*!<Request Completed Mailbox2 */
#define CAN_TSR_TXOK2_Pos      (17U)                                           
#define CAN_TSR_TXOK2_Msk      (0x1UL << CAN_TSR_TXOK2_Pos)                     /*!< 0x00020000 */
#define CAN_TSR_TXOK2          CAN_TSR_TXOK2_Msk                               /*!<Transmission OK of Mailbox 2 */
#define CAN_TSR_ALST2_Pos      (18U)                                           
#define CAN_TSR_ALST2_Msk      (0x1UL << CAN_TSR_ALST2_Pos)                     /*!< 0x00040000 */
#define CAN_TSR_ALST2          CAN_TSR_ALST2_Msk                               /*!<Arbitration Lost for mailbox 2 */
#define CAN_TSR_TERR2_Pos      (19U)                                           
#define CAN_TSR_TERR2_Msk      (0x1UL << CAN_TSR_TERR2_Pos)                     /*!< 0x00080000 */
#define CAN_TSR_TERR2          CAN_TSR_TERR2_Msk                               /*!<Transmission Error of Mailbox 2 */
#define CAN_TSR_ABRQ2_Pos      (23U)                                           
#define CAN_TSR_ABRQ2_Msk      (0x1UL << CAN_TSR_ABRQ2_Pos)                     /*!< 0x00800000 */
#define CAN_TSR_ABRQ2          CAN_TSR_ABRQ2_Msk                               /*!<Abort Request for Mailbox 2 */
#define CAN_TSR_CODE_Pos       (24U)                                           
#define CAN_TSR_CODE_Msk       (0x3UL << CAN_TSR_CODE_Pos)                      /*!< 0x03000000 */
#define CAN_TSR_CODE           CAN_TSR_CODE_Msk                                /*!<Mailbox Code */

