MikroElektronika/core_packages/ARM/gcc_clang/def/stm/STM32F373RB/mcu.h
/****************** TIM Instances : supporting commutation event generation ***/
#define IS_TIM_COMMUTATION_EVENT_INSTANCE(INSTANCE) (0)

/****************** TIM Instances : supporting remapping capability ***********/
#define IS_TIM_REMAP_INSTANCE(INSTANCE)\
  ((INSTANCE) == TIM14)

/****************************** TSC Instances *********************************/
#define IS_TSC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == TSC)

/******************** USART Instances : Synchronous mode **********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                     ((INSTANCE) == USART2) || \
                                     ((INSTANCE) == USART3))

/****************** USART Instances : Auto Baud Rate detection ****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                            ((INSTANCE) == USART2) || \
                                                            ((INSTANCE) == USART3))

/******************** UART Instances : Asynchronous mode **********************/
#define IS_UART_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                      ((INSTANCE) == USART2) || \
                                      ((INSTANCE) == USART3))
                                      
/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                 ((INSTANCE) == USART2) || \
                                                 ((INSTANCE) == USART3))
                                      
/******************** UART Instances : LIN mode **********************/
#define IS_UART_LIN_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                          ((INSTANCE) == USART2) || \
                                          ((INSTANCE) == USART3))
                                          
/******************** UART Instances : Wake-up from Stop mode **********************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE)   (((INSTANCE) == USART1) || \
                                                      ((INSTANCE) == USART2) || \
                                                      ((INSTANCE) == USART3))

/****************** UART Instances : Hardware Flow control ********************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                           ((INSTANCE) == USART2) || \
                                           ((INSTANCE) == USART3))

/****************** UART Instances : Auto Baud Rate detection *****************/
#define IS_UART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                           ((INSTANCE) == USART2) || \
                                                           ((INSTANCE) == USART3))

/****************** UART Instances : Driver Enable ****************************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                                  ((INSTANCE) == USART2) || \
                                                  ((INSTANCE) == USART3))

/********************* UART Instances : Smard card mode ***********************/
#define IS_SMARTCARD_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                         ((INSTANCE) == USART2) || \
                                         ((INSTANCE) == USART3))

/*********************** UART Instances : IRDA mode ***************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1) || \
                                    ((INSTANCE) == USART2) || \
                                    ((INSTANCE) == USART3))

/******************** UART Instances : Support of continuous communication using DMA ****/
#define IS_UART_DMA_INSTANCE(INSTANCE) (1)

/****************************** USB Instances *********************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) ((INSTANCE) == USB)

/****************************** WWDG Instances ********************************/
#define IS_WWDG_ALL_INSTANCE(INSTANCE)  ((INSTANCE) == WWDG)

/**
  * @}
  */


/******************************************************************************/
/*  For a painless codes migration between the STM32F3xx device product       */
/*  lines, the aliases defined below are put in place to overcome the         */
/*  differences in the interrupt handlers and IRQn definitions.               */
/*  No need to update developed interrupt code when moving across             */ 
/*  product lines within the same STM32F3 Family                              */
/******************************************************************************/

/* Aliases for __IRQn */
#define ADC1_2_IRQn             ADC1_IRQn
#define USB_LP_CAN_RX0_IRQn     CAN_RX0_IRQn
#define USB_HP_CAN_TX_IRQn      CAN_TX_IRQn
#define USBWakeUp_IRQn          CEC_IRQn
#define COMP1_2_IRQn            COMP_IRQn
#define COMP1_2_3_IRQn          COMP_IRQn
#define COMP2_IRQn              COMP_IRQn
#define ADC4_IRQn               SDADC1_IRQn
#define TIM8_BRK_IRQn           TIM12_IRQn
#define TIM8_UP_IRQn            TIM13_IRQn
#define TIM8_TRG_COM_IRQn       TIM14_IRQn
#define TIM1_BRK_TIM15_IRQn     TIM15_IRQn
#define TIM1_UP_TIM16_IRQn      TIM16_IRQn
#define TIM1_TRG_COM_TIM17_IRQn TIM17_IRQn
#define TIM1_CC_IRQn            TIM18_DAC2_IRQn
#define TIM20_UP_IRQn           TIM19_IRQn
#define TIM6_DAC_IRQn           TIM6_DAC1_IRQn
#define TIM7_DAC2_IRQn          TIM7_IRQn
#define USBWakeUp_RMP_IRQn      USBWakeUp_IRQn


/* Aliases for __IRQHandler */
#define ADC1_2_IRQHandler             ADC1_IRQHandler
#define USB_LP_CAN_RX0_IRQHandler     CAN_RX0_IRQHandler
#define USB_HP_CAN_TX_IRQHandler      CAN_TX_IRQHandler
#define USBWakeUp_IRQHandler          CEC_IRQHandler
#define COMP1_2_IRQHandler            COMP_IRQHandler
#define COMP1_2_3_IRQHandler          COMP_IRQHandler
#define COMP2_IRQHandler              COMP_IRQHandler
#define ADC4_IRQHandler               SDADC1_IRQHandler
#define TIM8_BRK_IRQHandler           TIM12_IRQHandler
#define TIM8_UP_IRQHandler            TIM13_IRQHandler
#define TIM8_TRG_COM_IRQHandler       TIM14_IRQHandler
#define TIM1_BRK_TIM15_IRQHandler     TIM15_IRQHandler
#define TIM1_UP_TIM16_IRQHandler      TIM16_IRQHandler
#define TIM1_TRG_COM_TIM17_IRQHandler TIM17_IRQHandler
#define TIM1_CC_IRQHandler            TIM18_DAC2_IRQHandler
#define TIM20_UP_IRQHandler           TIM19_IRQHandler
#define TIM6_DAC_IRQHandler           TIM6_DAC1_IRQHandler
#define TIM7_DAC2_IRQHandler          TIM7_IRQHandler
#define USBWakeUp_RMP_IRQHandler      USBWakeUp_IRQHandler


#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __STM32F373xC_H */

/**
  * @}
  */

/**
  * @}
  */
